#### terraform plan every: e000e5b
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.ssm.aws_ssm_parameter.mid: Refreshing state... [id=mid]
module.iam.aws_dynamodb_table.dynamo_kvs: Refreshing state... [id=dynamo_kvs]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:cluster/discord-instagram-bot]
module.ssm.aws_ssm_parameter.sessionid: Refreshing state... [id=sessionid]
module.ssm.aws_ssm_parameter.consumer_key: Refreshing state... [id=consumer_key]
module.ssm.aws_ssm_parameter.token: Refreshing state... [id=token]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0219c5015d0627f06]
module.ssm.aws_ssm_parameter.v_aws_access_key_id: Refreshing state... [id=v_aws_access_key_id]
module.ecr.aws_ecr_repository.main: Refreshing state... [id=discord-instagram-bot]
module.cloudwatch.aws_cloudwatch_log_group.main: Refreshing state... [id=/aws/ecs/discord-instagram-bot]
aws_s3_bucket.discord-python-image: Refreshing state... [id=discord-python-image]
module.ssm.aws_ssm_parameter.v_aws_secret_access_key: Refreshing state... [id=v_aws_secret_access_key]
aws_s3_bucket.discord-python-video: Refreshing state... [id=discord-python-video]
module.iam.aws_dynamodb_table.tweet_json: Refreshing state... [id=tweet_json]
module.iam.aws_dynamodb_table.instagram_json: Refreshing state... [id=instagram_json]
module.ssm.aws_ssm_parameter.consumer_secret: Refreshing state... [id=consumer_secret]
module.iam.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=EcsTaskRole-discord-instagram-bot]
module.iam.aws_iam_policy.iam_dynamo_dynamo_kvs: Refreshing state... [id=arn:aws:iam::554506578892:policy/dynamo_kvs-policy]
module.iam.aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=EcsTaskRole-discord-instagram-bot:cloudwatch_logs]
module.iam.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_for_ecr: Refreshing state... [id=EcsTaskRole-discord-instagram-bot-20210515144659286700000001]
module.iam.aws_iam_role_policy_attachment.dynamo_kvs: Refreshing state... [id=EcsTaskRole-discord-instagram-bot-20211124164410554700000001]
module.iam.aws_iam_role_policy.ecs_to_ssm: Refreshing state... [id=EcsTaskRole-discord-instagram-bot:ecs_to_ssm]
module.ecs.aws_ecs_task_definition.main: Refreshing state... [id=discord-instagram-bot-task-definition]
module.iam.aws_iam_policy.iam_dynamo_tweet_json: Refreshing state... [id=arn:aws:iam::554506578892:policy/tweet_json-policy]
module.iam.aws_iam_policy.iam_dynamo_instagram_json: Refreshing state... [id=arn:aws:iam::554506578892:policy/instagram_json-policy]
module.iam.aws_iam_role_policy_attachment.tweet_json: Refreshing state... [id=EcsTaskRole-discord-instagram-bot-20211114092543431800000001]
module.iam.aws_iam_role_policy_attachment.instagram_json: Refreshing state... [id=EcsTaskRole-discord-instagram-bot-20211114210746716300000001]
module.security.aws_security_group.ecs: Refreshing state... [id=sg-086c267e1e2207c43]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-07adf71781ae87ed1]
module.vpc.aws_route_table.privates[1]: Refreshing state... [id=rtb-0b972285c43ef8586]
module.vpc.aws_route_table.privates[0]: Refreshing state... [id=rtb-09dfe003f37f6fa01]
module.vpc.aws_route_table.privates[2]: Refreshing state... [id=rtb-0292c7a41f76eb5cf]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0e45a090904c9ab1d]
module.vpc.aws_subnet.privates[0]: Refreshing state... [id=subnet-0fb948f228d9d112f]
module.security.aws_security_group.alb: Refreshing state... [id=sg-0da582b80a2919b39]
module.vpc.aws_subnet.publics[0]: Refreshing state... [id=subnet-0b3f607aa8028d7d7]
module.vpc.aws_subnet.publics[1]: Refreshing state... [id=subnet-011f1a6e62c871778]
module.vpc.aws_subnet.publics[2]: Refreshing state... [id=subnet-0811d6780fa40db10]
module.vpc.aws_subnet.privates[1]: Refreshing state... [id=subnet-007456b5f4d45d89f]
module.vpc.aws_subnet.privates[2]: Refreshing state... [id=subnet-0aed969abfb5a6b8a]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-0e45a090904c9ab1d1080289494]
module.vpc.aws_route_table_association.privates[1]: Refreshing state... [id=rtbassoc-0730f79efc3000e03]
module.vpc.aws_route_table_association.privates[2]: Refreshing state... [id=rtbassoc-0bab84d600257f8aa]
module.vpc.aws_route_table_association.privates[0]: Refreshing state... [id=rtbassoc-06e92ec6691013325]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a11d6b569f35e936]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b0ccfb579951dc58]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-086f9e70679e407a4]
module.ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:service/discord-instagram-bot/discord-instagram-bot]
aws_s3_bucket_policy.discord-python-image-policy: Refreshing state... [id=discord-python-image]
aws_s3_bucket_policy.discord-python-video-policy: Refreshing state... [id=discord-python-video]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ecs.aws_ecs_task_definition.main has changed
  ~ resource "aws_ecs_task_definition" "main" {
        id                       = "discord-instagram-bot-task-definition"
      + tags                     = {}
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.data.template_file.container_definitions will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "container_definitions"  {
      ~ id       = "6cec846274dfa1b058ea13992c27c9d75403e50599ba22bb47e48c96a564cce5" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "CONTAINER_TAG"
                          - value = "1.1.0-e419b75"
                        },
                      - {
                          - name  = "DEBUG"
                          - value = "1"
                        },
                    ]
                  - image            = "554506578892.dkr.ecr.ap-northeast-1.amazonaws.com/discord-instagram-bot:1.1.0-e419b75"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/discord-instagram-bot"
                          - awslogs-region        = "ap-northeast-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - name             = "discord-instagram-bot"
                  - secrets          = [
                      - {
                          - name      = "TOKEN"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/token"
                        },
                      - {
                          - name      = "CONSUMER_KEY"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/consumer_key"
                        },
                      - {
                          - name      = "CONSUMER_SECRET"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/consumer_secret"
                        },
                      - {
                          - name      = "MID"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/mid"
                        },
                      - {
                          - name      = "SESSIONID"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/sessionid"
                        },
                      - {
                          - name      = "AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/v_aws_access_key_id"
                        },
                      - {
                          - name      = "AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/v_aws_secret_access_key"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ template = jsonencode(
          ~ [
              ~ {
                    name             = "${container_name}"
                  ~ secrets          = [
                        # (6 unchanged elements hidden)
                        {
                            name      = "AWS_SECRET_ACCESS_KEY"
                            valueFrom = "${aws_secret_access_key_arn}"
                        },
                      + {
                          + name      = "ES_HOST"
                          + valueFrom = "${aws_secret_es_host_arn}"
                        },
                      + {
                          + name      = "ES_USER_NAME"
                          + valueFrom = "${aws_secret_es_user_name_arn}"
                        },
                      + {
                          + name      = "ES_PASSWORD"
                          + valueFrom = "${aws_secret_es_password_arn}"
                        },
                      + {
                          + name  = "ENV"
                          + value = "${env}"
                        },
                    ]
                    # (3 unchanged elements hidden)
                },
            ]
        )
      ~ vars     = {
          ~ "container_tag"             = "1.1.0-e419b75" -> "1.1.0-3493dad"
          + "env"                       = "prod"
          + "es_host_arn"               = (known after apply)
          + "es_password_arn"           = (known after apply)
          + "es_user_name_arn"          = (known after apply)
            # (10 unchanged elements hidden)
        }
    }

  # module.ecs.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ap-northeast-1:554506578892:service/discord-instagram-bot/discord-instagram-bot"
        name                               = "discord-instagram-bot"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:554506578892:task-definition/discord-instagram-bot-task-definition:60" -> (known after apply)
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:554506578892:task-definition/discord-instagram-bot-task-definition:60" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "CONTAINER_TAG"
                          - value = "1.1.0-e419b75"
                        },
                      - {
                          - name  = "DEBUG"
                          - value = "1"
                        },
                    ]
                  - essential        = true
                  - image            = "554506578892.dkr.ecr.ap-northeast-1.amazonaws.com/discord-instagram-bot:1.1.0-e419b75"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/discord-instagram-bot"
                          - awslogs-region        = "ap-northeast-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "discord-instagram-bot"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "TOKEN"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/token"
                        },
                      - {
                          - name      = "CONSUMER_KEY"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/consumer_key"
                        },
                      - {
                          - name      = "CONSUMER_SECRET"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/consumer_secret"
                        },
                      - {
                          - name      = "MID"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/mid"
                        },
                      - {
                          - name      = "SESSIONID"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/sessionid"
                        },
                      - {
                          - name      = "AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/v_aws_access_key_id"
                        },
                      - {
                          - name      = "AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/v_aws_secret_access_key"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "discord-instagram-bot-task-definition" -> (known after apply)
      ~ revision                 = 60 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.ssm.aws_ssm_parameter.es_host will be created
  + resource "aws_ssm_parameter" "es_host" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "es_host"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.ssm.aws_ssm_parameter.es_password will be created
  + resource "aws_ssm_parameter" "es_password" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "es_user_name"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.ssm.aws_ssm_parameter.es_user_name will be created
  + resource "aws_ssm_parameter" "es_user_name" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "es_user_name"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

Plan: 4 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.discord-python-video,
  on main.tf line 146, in resource "aws_s3_bucket" "discord-python-video":
 146: resource "aws_s3_bucket" "discord-python-video" {

Use the aws_s3_bucket_cors_configuration resource instead

(and 11 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

<details><summary>Show Plan Error</summary>

```terraform

```

</details>


*Pusher: @lazmond3, Action: `pull_request`*